video_notes/video_notes.org
#+title: MIT 6.001 1986 Video Notes
#+latex_class: org-report
#+latex_header: \usepackage{tikz-cd}
#+latex_header: \usepackage{parskip}
#+latex_header: \usepackage[type={CC}, modifier={by-nc}, version={3.0},]{doclicense}
#+latex_header: \usepackage{forest}
#+latex_class_options: [9pt]
#+latex_header:\usepackage{sectsty}
#+latex_header:\sectionfont{\fontsize{12}{15}\selectfont}
#+latex_header:\subsectionfont{\fontsize{11}{11}\selectfont}
#+latex_header: \setlength\parindent{0pt}
#+latex_header: \usepackage{parskip}
#+latex_header: \usepackage{pifont}
#+latex_header: \makeatletter
#+latex_header: \def\@makechapterhead#1{%
#+latex_header:  {\parindent \z@ \raggedright \normalfont
#+latex_header:    \ifnum \c@secnumdepth >\m@ne
#+latex_header:        \LARGE\bfseries \thechapter~
#+latex_header:    \fi
#+latex_header:    \interlinepenalty\@M
#+latex_header:    \LARGE \bfseries #1\par\nobreak
#+latex_header:    \vskip 10\p@
#+latex_header:  }}
#+latex_header:\def\@makeschapterhead#1{%
#+latex_header:  {\parindent \z@ \raggedright
#+latex_header:    \normalfont
#+latex_header:    \interlinepenalty\@M
#+latex_header:    \Huge \bfseries  #1\par\nobreak
#+latex_header:    \vskip 10\p@
#+latex_header:  }}
#+latex_header:\makeatother

* Introduction

** About
   These are my notes of the twenty SICP lectures of June 1986,
   produced by Hewlett-Packard Television. These videos are available
   under a Creative Commons license. These videos should be included in
   a directory called =./videos=.

   These notes aim to be concise and as example-heavy as possible. The
   language used and referred to as "Lisp" is MIT-Scheme. These notes,
   however, use the SICP language provided by Racket, a modern Scheme
   dialect. This is because Racket's integration with Emacs and
   =org-mode= is orders of magnitude better than MIT-Scheme's. In
   general, all "Lisp" code looks exactly the same as in SICP, with the
   exception of having to prefix some numbers with =#i= to ensure
   Racket treats them as imprecise.

** License
   \doclicenseThis

* Lecture 1A: Overview and Introduction to Lisp

  Computer science isn't really a science, and it isn't really about
  computers. Computer science is the study of how-to or imperative
  knowledge (as opposed to declarative knowledge). To illustrate the
  difference, consider:

  $$y = \sqrt{x} \mathrm{~such~that~} y^2=x, y \geq 0$$

  This is declarative, in that we could recognize if $y$ is the square
  root of $x$ given $x$ and $y$, but we're no closer to knowing how to
  /find/ $y$ if we are given $x$. Imperative knowledge would look
  like:

  To find the square root $y$ of $x$:
  - Make a guess $g$.
  - If $g^2$ is close enough to $x$, $y=g$.
  - Otherwise, make a new guess equal to the average of $g$ and $x/g$.

  This method will eventually come up with a $g$ close enough to the
  actual square root $y$ of $x$.

  Computer science focuses on this kind of imperative knowledge, and,
  specifically, how to communicate that knowledge to a computer.

** Managing Complexity: Key Ideas of 6.001
   Computer science is also about managing complexity, in that large
   programs that you can't hold in your head should still be manageable
   and easy to work with. We explore this theme in 6.001 by learning
   three key ideas:

   - Black-box abstractions
   - Conventional interfaces
   - Metalinguistic abstraction.


** Let's Learn Lisp
   When learning a new language, always ask about its:
   - Primitive elements,
   - Means of combination, and
   - Means of abstraction.

*** Primitive Elements
    These are numbers like 3, 17.4, or 5. Other primitives are
    discussed later in the course.

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      4
      17.4
      5
    #+END_SRC

    #+RESULTS:
    : 4
    : 17.4
    : 5

*** Means of Combination
    Lisp's numerical primitives can be combined with "operations" such
    as addition, written in prefix notation.

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (+ 3 17.4 5)
    #+END_SRC

    #+RESULTS:
    : 25.4

    Other basic operations are provided by Lisp, such as
    multiplication and division. Of course, combinations can be
    combined recursively:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (+ 3 (* 5 6) 8 2)
    #+END_SRC

    #+RESULTS:
    : 43

    This should show you the tree structure inherent in all of Lisp:
    #+LATEX: \begin{center}
    #+LATEX: \begin{forest}
    #+LATEX: [+
    #+LATEX: [* [5] [6]] [8] [2]]
    #+LATEX: \end{forest}
    #+LATEX: \end{center}

    In Lisp, () is the application of an operation or function in
    prefix notation.

*** Means of Abstraction

    Abstraction can simply be done by naming things. Giving
    complicated things a name prevents us from having to understand
    how the thing the name refers to /works/, and instead lets us
    "abstractly" use the name for our purposes.

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define a (* 5 5))
      a
      (* a a)
      (define b (+ a (* 5 a)))
      b
      (+ a (/ b 5))
    #+END_SRC

    #+RESULTS:
    : 25
    : 625
    : 150
    : 55

    Now, it's often more useful to abstract away imperative how-to
    knowledge. Consider:

    #+NAME: square
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (square x)
        (* x x))
    #+END_SRC

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<square>>
      (square 10)
    #+END_SRC

    #+RESULTS:
    : 100

    This defines =square= as a function taking a single argument =x=,
    and returning =(* x x)=. Note that this way of writing a define is
    actually "syntactic sugar" for:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define square
        (lambda (x)
          (* x x)))

      (square 25)
    #+END_SRC

    #+RESULTS:
    : 625

    =lambda (x)= means "make a procedure that takes argument =x=". The
    second argument to lambda is the actual procedure body. The
    =define= names this anonymous procedure =square=.

    Just like we can use combinations recursively, so we can
    abstractions. Consider:

    #+NAME: average
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (average x y)
        (/ (+ x y) 2))
    #+END_SRC

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<square>>
      <<average>>
      (define (mean-square x y)
        (average (square x)
                 (square y)))

      (mean-square 2 3)
    #+END_SRC

    #+RESULTS:
    : 13/2

    Note the indentation: since Lisp is parenthesis heavy, we use
    indentation. Good editors like Emacs should do this automatically.

