video_notes/video_notes.tex
% Created 2021-06-07 Mon 18:17
% Intended LaTeX compiler: xelatex
\documentclass[9pt]{report}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage[hidelinks]{hyperref}
\usepackage[a4paper, total={6in,9in}]{geometry}
         \usepackage{booktabs}
\usepackage{minted}
         \usepackage{tikz-cd}
\usepackage{parskip}
\usepackage[type={CC}, modifier={by-nc}, version={3.0},]{doclicense}
\usepackage{forest}
\usepackage{sectsty}
\sectionfont{\fontsize{12}{15}\selectfont}
\subsectionfont{\fontsize{11}{11}\selectfont}
\setlength\parindent{0pt}
\usepackage{parskip}
\usepackage{pifont}
\makeatletter
\def\@makechapterhead#1{%
{\parindent \z@ \raggedright \normalfont
\ifnum \c@secnumdepth >\m@ne
\LARGE\bfseries \thechapter~
\fi
\interlinepenalty\@M
\LARGE \bfseries #1\par\nobreak
\vskip 10\p@
}}
\def\@makeschapterhead#1{%
{\parindent \z@ \raggedright
\normalfont
\interlinepenalty\@M
\Huge \bfseries  #1\par\nobreak
\vskip 10\p@
}}
\makeatother
\author{Nebhrajani A.V.}
\date{\today}
\title{MIT 6.001 1986 Video Notes}
\hypersetup{
 pdfauthor={Nebhrajani A.V.},
 pdftitle={MIT 6.001 1986 Video Notes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.2 (Org mode 9.3.6)},
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\chapter{Introduction}
\label{sec:orgb70755d}

\section{About}
\label{sec:org35c841f}
These are my notes of the twenty SICP lectures of June 1986,
produced by Hewlett-Packard Television. These videos are available
under a Creative Commons license. These videos should be included in
a directory called \texttt{./videos}.

These notes aim to be concise and as example-heavy as possible. The
language used and referred to as ``Lisp'' is MIT-Scheme. These notes,
however, use the SICP language provided by Racket, a modern Scheme
dialect. This is because Racket's integration with Emacs and
\texttt{org-mode} is orders of magnitude better than MIT-Scheme's. In
general, all ``Lisp'' code looks exactly the same as in SICP, with the
exception of having to prefix some numbers with \texttt{\#i} to ensure
Racket treats them as imprecise.

\section{License}
\label{sec:orgfab2bee}
\doclicenseThis

\chapter{Lecture 1A: Overview and Introduction to Lisp}
\label{sec:org17aa150}

Computer science isn't really a science, and it isn't really about
computers. Computer science is the study of how-to or imperative
knowledge (as opposed to declarative knowledge). To illustrate the
difference, consider:

$$y = \sqrt{x} \mathrm{~such~that~} y^2=x, y \geq 0$$

This is declarative, in that we could recognize if \(y\) is the square
root of \(x\) given \(x\) and \(y\), but we're no closer to knowing how to
\emph{find} \(y\) if we are given \(x\). Imperative knowledge would look
like:

To find the square root \(y\) of \(x\):
\begin{itemize}
\item Make a guess \(g\).
\item If \(g^2\) is close enough to \(x\), \(y=g\).
\item Otherwise, make a new guess equal to the average of \(g\) and \(x/g\).
\end{itemize}

This method will eventually come up with a \(g\) close enough to the
actual square root \(y\) of \(x\).

Computer science focuses on this kind of imperative knowledge, and,
specifically, how to communicate that knowledge to a computer.

\section{Managing Complexity: Key Ideas of 6.001}
\label{sec:orga6b7c0b}
Computer science is also about managing complexity, in that large
programs that you can't hold in your head should still be manageable
and easy to work with. We explore this theme in 6.001 by learning
three key ideas:

\begin{itemize}
\item Black-box abstractions
\item Conventional interfaces
\item Metalinguistic abstraction.
\end{itemize}


\section{Let's Learn Lisp}
\label{sec:org861e677}
When learning a new language, always ask about its:
\begin{itemize}
\item Primitive elements,
\item Means of combination, and
\item Means of abstraction.
\end{itemize}

\subsection{Primitive Elements}
\label{sec:org09b8507}
These are numbers like 3, 17.4, or 5. Other primitives are
discussed later in the course.

\begin{minted}[]{racket}
4
17.4
5
\end{minted}

\begin{verbatim}
4
17.4
5
\end{verbatim}

\subsection{Means of Combination}
\label{sec:org4d1dd4a}
Lisp's numerical primitives can be combined with ``operations'' such
as addition, written in prefix notation.

\begin{minted}[]{racket}
(+ 3 17.4 5)
\end{minted}

\begin{verbatim}
25.4
\end{verbatim}


Other basic operations are provided by Lisp, such as
multiplication and division. Of course, combinations can be
combined recursively:

\begin{minted}[]{racket}
(+ 3 (* 5 6) 8 2)
\end{minted}

\begin{verbatim}
43
\end{verbatim}


This should show you the tree structure inherent in all of Lisp:
\begin{center}
\begin{forest}
[+
[* [5] [6]] [8] [2]]
\end{forest}
\end{center}

In Lisp, () is the application of an operation or function in
prefix notation.

\subsection{Means of Abstraction}
\label{sec:org9d9e2e3}

Abstraction can simply be done by naming things. Giving
complicated things a name prevents us from having to understand
how the thing the name refers to \emph{works}, and instead lets us
``abstractly'' use the name for our purposes.

\begin{minted}[]{racket}
(define a (* 5 5))
a
(* a a)
(define b (+ a (* 5 a)))
b
(+ a (/ b 5))
\end{minted}

\begin{verbatim}
25
625
150
55
\end{verbatim}


Now, it's often more useful to abstract away imperative how-to
knowledge. Consider:

\begin{minted}[]{racket}
(define (square x)
  (* x x))
\end{minted}

\begin{minted}[]{racket}

(square 10)
\end{minted}

\begin{verbatim}
100
\end{verbatim}


This defines \texttt{square} as a function taking a single argument \texttt{x},
and returning \texttt{(* x x)}. Note that this way of writing a define is
actually ``syntactic sugar'' for:

\begin{minted}[]{racket}
(define square
  (lambda (x)
    (* x x)))

(square 25)
\end{minted}

\begin{verbatim}
625
\end{verbatim}


\texttt{lambda (x)} means ``make a procedure that takes argument \texttt{x}''. The
second argument to lambda is the actual procedure body. The
\texttt{define} names this anonymous procedure \texttt{square}.

Just like we can use combinations recursively, so we can
abstractions. Consider:

\begin{minted}[]{racket}
(define (average x y)
  (/ (+ x y) 2))
\end{minted}

\begin{minted}[]{racket}


(define (mean-square x y)
  (average (square x)
           (square y)))

(mean-square 2 3)
\end{minted}

\begin{verbatim}
13/2
\end{verbatim}


Note the indentation: since Lisp is parenthesis heavy, we use
indentation. Good editors like Emacs should do this automatically.
