video_notes/video_notes.tex

\section{Case Analysis in Lisp}
\label{sec:org6a6abb3}

To represent functions like:
$$abs(x) = \begin{cases}
   -x & x<0\\
   0 & x = 0\\
   x & x > 0
   \end{cases}$$
Lisp needs some form of conditional execution. In Lisp, this
function would look like:

\begin{minted}[]{racket}
(define (abs x)
  (cond ((< x 0) (- x))
        ((= x 0) 0)
        ((> x 0) x)))
(abs -3)
(abs 0)
(abs 5)
\end{minted}

\begin{verbatim}
3
0
5
\end{verbatim}


\texttt{cond} takes any number of arguments. Each argument must be
structured as \texttt{(predicate) (consequent)}. If \texttt{predicate} is true,
we do the \texttt{consequent}. Otherwise, we don't. Lisp also provides a
way to write conditionals that only have two branches (an if-else):

\begin{minted}[]{racket}
(define (abs x)
  (if (< x 0)
      (- x)
      x))
\end{minted}

\begin{minted}[]{racket}

(abs -11)
(abs 0)
(abs 33)
\end{minted}

\begin{verbatim}
11
0
33
\end{verbatim}


\texttt{cond} and \texttt{if} are syntactical sugar for each other. The Lisp
implementation picks any one and defines the other in terms of it.

We now know most of Lisp. Lisp doesn't have \texttt{do...while} or \texttt{for},
since anything a loop can do can be done via recursion.

\section{Finding Square Roots}
\label{sec:orge9ed958}

Remember our square root finding algorithm?

To find the square root \(y\) of \(x\):
\begin{itemize}
\item Make a guess \(g\).
\item If \(g^2\) is close enough to \(x\), \(y=g\).
\item Otherwise, make a new guess equal to the average of \(g\) and
\(x/g\).
\end{itemize}

Or, in Lisp,

\begin{minted}[]{racket}
(define (try g x)
  (if (good-enough-p g x)
      g
      (try (improve g x) x)))
\end{minted}

This is a form of programming called ``wishful thinking'': we assume
\texttt{good-enough-p} (good enough predicate) and \texttt{improve} are already
implemented. Now that we can try a guess and improve it till it's
good enough, we can write a simple square root function:

\begin{minted}[]{racket}
(define (sqrt x)
  (try 1 x))
\end{minted}

This function simply starts the guess at 1, then improves it. Let's
now write the functions we don't have:

\begin{minted}[]{racket}
(define (improve g x)
  (average g (/ x g)))
\end{minted}

\begin{minted}[]{racket}
(define (good-enough-p g x)
  (< (abs (- (square g) x))
     0.00001))
\end{minted}

This tests if \(g^2\) is within 0.0001 of \(x\). Putting it all
together, we can finally try to find square roots:

\begin{minted}[]{racket}







(sqrt #i2)
(sqrt #i3)
(sqrt #i4)
\end{minted}

\begin{verbatim}
1.4142156862745097
1.7320508100147274
2.0000000929222947
\end{verbatim}


\begin{quote}
\textbf{Note:} The \texttt{\#i4} is Racket's syntax for using imprecise
(decimals) instead of precise (fractions). Ignore it, and treat it
as the number \texttt{4}.
\end{quote}

See that \texttt{try} actually runs a loop, but does so recursively,
calling itself every time the \texttt{if} condition fails to improve the
guess. Also note that these functions can all be nested inside the
square root function to hide them from the outer scope, thus:

\begin{minted}[]{racket}
(define (sqrt x)
  (define (good-enough-p g)
    (define (square g)
      (* g g))
    (define (abs y)
      (if (< y 0)
          (- y)
          y))
    (< (abs (- (square g) x))
       0.0001))
  (define (improve g)
    (define (average y z)
      (/ (+ y z) 2))
    (average g (/ x g)))
  (define (try g)
    (if (good-enough-p g)
        g
        (try (improve g))))
  (try 1))

(sqrt #i2)
\end{minted}

\begin{verbatim}
1.4142156862745097
\end{verbatim}


This program should also show you a tree-like dependency of the
functions, with each function containing the definitions of the
functions it depends on. For someone using \texttt{sqrt}, all the functions
within it are hidden.

\begin{center}
\begin{forest}
[\texttt{sqrt}
[\texttt{try}
[\texttt{good-enough-p}
[\texttt{abs}] [\texttt{square}]]
[\texttt{improve}
[\texttt{average}]]
[\texttt{try}]]]
\end{forest}
\end{center}

This discipline of writing procedures is called lexical scoping.


\section{Inbuilt/Primitive Procedures Aren't Special}
\label{sec:org452cc17}

\begin{minted}[]{racket}

square
+
\end{minted}

\begin{verbatim}
#<procedure:square>
#<procedure:+>
\end{verbatim}

\chapter{Lecture 1B: Procedures and Processes, Substitution Model}
\label{sec:org77ffef6}

\section{Substitution Rule/Model}
\label{sec:orgff43aa3}
The substitution rule states that,

\begin{quote}
To evaluate an application:
\begin{itemize}
\item Evaluate the operator to get procedure.
\item Evaluate the operands to get arguments.
\item Apply procedure to arguments.
\begin{itemize}
\item Copy body of procedure.
\item Replace formal parameters with actual arguments.
\end{itemize}
\item Evaluate new body.
\end{itemize}
\end{quote}

Note that this isn't necessarily how the \emph{interpreter} evaluates a
Lisp application, but the substitution rule is a ``good enough''
model for our purposes.

\subsection{Kinds of Expressions in Lisp}
\label{sec:orgc344207}
\begin{itemize}
\item Numbers (evaluate to ``themselves'')
\item Symbols (represent some procedure)
\item Combinations
\item \(\lambda\)-expressions (used to build procedures)
\item Definitions (used to name symbols)
\item Conditionals
\end{itemize}

We will focus our use of the substitution rule on the first three.
The last three are called ``special forms'', and we'll worry about
them later.

\subsection{Example}
\label{sec:org857e840}

Consider:

\begin{minted}[]{racket}

(define (sum-of-squares x y)
  (+ (square x) (square y)))

(sum-of-squares 3 4)
\end{minted}

\begin{verbatim}
25
\end{verbatim}


Let's try to apply the substitution rule to our application,

\begin{minted}[]{racket}
(sum-of-squares 3 4)
(+ (square 3) (square 4))
(+ (square 3) (* 4 4))
(+ (square 3) 16)
(+ (* 3 3) 16)
(+ 9 16)
25
\end{minted}

\section{Peano Arithmetic}
\label{sec:orgc7513d1}

\subsection{Simple Peano Addition}
\label{sec:orgd9585b3}
Peano arithmetic defines addition as:

\begin{minted}[]{racket}
(define (pa+ x y)
  (if (= x 0)
      y
      (pa+ (dec x) (inc y))))
\end{minted}

\begin{minted}[]{racket}

(pa+ 3 4)
\end{minted}

\begin{verbatim}
7
\end{verbatim}


Assume that \texttt{inc} and \texttt{dec} are primitives available that increment
and decrement the argument respectively. How is the procedure \texttt{pa+}
working? Let's apply the substitution rule.

\begin{minted}[]{racket}
(pa+ 3 4)
(if (= 3 0)
    4
    (pa+ (dec 3) (inc 4)))
(pa+ 2 5)
...
(pa+ 1 6)
...
(pa+ 0 7)
7
\end{minted}

We're skipping some steps, but the idea is that \texttt{x} keeps giving
one ``unit'' to \texttt{y} until it reaches zero. Then the sum is \texttt{y}.
Written with steps skipped:

\begin{minted}[]{racket}
(pa+ 3 4)
(pa+ 2 5)
(pa+ 1 6)
(pa+ 0 7)
7
\end{minted}
