video_notes/video_notes.org
*** Another Peano Adder
    Consider:
    #+NAME: peano-b
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      (define (pb+ x y)
        (if (= x 0)
            y
            (inc (pb+ (dec x) y))))
    #+END_SRC


    This is also a Peano adder: but it's implemented /slightly/
    differently syntax-wise, a few characters here and there. Let's
    use the substitution rule to see how it works.

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (pb+ 3 4)
      (inc (pb+ 2 4))
      (inc (inc (pb+ 1 4)))
      (inc (inc (inc (pb+ 0 4))))
      (inc (inc ((inc 4))))
      (inc (inc 5))
      (inc 6)
      7
    #+END_SRC

    See that it /does/ work:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<peano-b>>
      (pb+ 3 4)
    #+END_SRC

    #+RESULTS:
    : 7

    Now, consider how these two, =pa+= and =pb+=, are different. While
    the /procedures/ do the same thing, the processes are wildly
    different. Let's discuss their time and space complexity.
    It should be obvious to you that the time complexity is the
    vertical axis in the substitution rule application, since the
    interpreter "executes" these instructions line by line. More lines
    means more time.

    In the case of =pa+=, the number of lines increases by 1 if you
    increase input =x= by 1. Thus, the time complexity is $O(x)$.
    Similarly, in the case of =pb+=, the number of lines increases by
    2 (once in the expansion, once in the contraction) when you
    increase =x= by 1. Thus, it is also $O(x)$.

    Now, the horizontal axis shows us how much space is being used. In
    the case of =pa+=, the space used is a constant. Thus, $O(1)$. On
    the other hand, see that =pb+= first /expands/ then /contracts/.
    The length of the maximum expansion increases by 1 if we increase
    $x$ by 1, since there's one more increment to do. Thus, $O(x)$.

    Now, we call a process like =pa+= /linear iterative/ and a process
    like =pb+= /linear recursive/.

    #+ATTR_LATEX: :booktabs t :align lccl
    | Process | Time Complexity | Space Complexity | Type             |
    |---------+-----------------+------------------+------------------|
    | =pa+=   | $O(x)$          | $O(1)$           | Linear iterative |
    | =pb+=   | $O(x)$          | $O(x)$           | Linear recursive |

    Note that the /process/ =pa+= being iterative has nothing to do
    with the implementation/definition of the /procedure/, which is
    recursive. Iteration refers to the constant space requirement.

** Differentiating Between Iterative and Recursive Processes

   One of the primary ways to differentiate between an iterative and
   recursive process is to imagine what'd happen if you turned the
   computer off, then resumed the current computation.

   In a recursive process, we've lost some important information: how
   deep into the recursion we are. In the =pb+= example, we wouldn't
   know how many =inc='s deep we are (information stored in the RAM by
   the interpreter, not by the process), meaning that we can't return
   the right value.

   In an iterative process, we can pick up right where we left off,
   since /all/ state information is contained by the process.

** Fibonacci Numbers

   Fibonacci numbers are defined as:

   $$F(x) =
   \begin{cases}
   0, & x = 0\\
   1, & x = 1\\
   F(x-1) + F(x-2), & \mathrm{otherwise}
   \end{cases}$$

   The series itself is:
   $$0,1,1,2,3,5,8,13,21,34,55\hdots$$

   Let's write a Lisp function to calculate the $n\mathrm{th}$ Fibonacci
   number, assuming 0 is the 0th.

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (fib n)
       (if (< n 2)
           n
           (+ (fib (- n 1))
              (fib (- n 2)))))
     (fib 10)
   #+END_SRC

   #+RESULTS:
   : 55

   It works, that's true. But how /well/ does it work. Let's see. When
   we call (say) =(fib 4)=, we also call =(fib 3)= and =(fib 2)=, both
   of which also call $\hdots$ let's draw it:

   #+LATEX: \begin{center}
   #+LATEX: \begin{forest}
   #+LATEX: [\texttt{(fib 4)}
   #+LATEX: [\texttt{(fib 3)}
   #+LATEX: [\texttt{(fib 2)} [\texttt{(fib 1)} [1]] [\texttt{(fib 0)} [0]]]
   #+LATEX: [\texttt{(fib 1)} [1]]]
   #+LATEX: [\texttt{(fib 2)} [\texttt{(fib 1)} [1]] [\texttt{(fib 0)} [0]]]]
   #+LATEX: \end{forest}
   #+LATEX: \end{center}

   A tree! Clearly, this is an exponential-time process, since
   computing $n+1$ takes exponentially more effort. Also note that
   it's a pretty bad process, since we constantly recompute many
   values. The space complexity is the maximum depth of the tree
   (depth of recursion), which is at most $n$. Therefore, the time
   complexity is $O(\mathrm{fib}(n))$ and space complexity is $O(n)$.

   It is useful to try and write an iterative Fibonacci with better
   performance as an exercise.

** Towers of Hanoi

   From Wikipedia:

   #+begin_quote
   The Tower of Hanoi is a mathematical game or puzzle. It consists of
   three rods and a number of disks of different diameters, which can
   slide onto any rod. The puzzle starts with the disks stacked on one
   rod in order of decreasing size, the smallest at the top, thus
   approximating a conical shape. The objective of the puzzle is to
   move the entire stack to the last rod, obeying the following simple
   rules:

   - Only one disk may be moved at a time.
   - Each move consists of taking the upper disk from one of the
     stacks and placing it on top of another stack or an empty rod.
   - No disk may be placed on top of a disk that is smaller than it.
   #+end_quote

   Let's try to solve Hanoi for 4 disks, from rod A to rod C. Again
   --- "wishful thinking". Let's assume that we know how to solve for
   3 disks. To solve, we'd take the top 3 disks, put it on the spare
   rod B. Then, we'd take the fourth and largest disk, and put it on
   destination rod C. Finally, we'd move the three disk pile from B
   to C. Solved!

   But wait --- to solve the 3 disk case, let's assume we know how to
   solve the 2 disk case.

   To solve the 2 disk case, we should know how
   to solve the one disk case, which is just moving a disk from a rod
   to another.

   Or, in Lisp,

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (move n from to spare)
       (cond ((= n 1) (display "Move disk at rod ")
                      (display from)
                      (display " to rod ")
                      (display to)
                      (display ".\n"))
             (else
              (move (- n 1) from spare to)
              (move 1 from to spare)
              (move (- n 1) spare to from))))

     (move 4 "A" "C" "B")
   #+END_SRC

   #+RESULTS:
   #+begin_example
   Move disk at rod A to rod B.
   Move disk at rod A to rod C.
   Move disk at rod B to rod C.
   Move disk at rod A to rod B.
   Move disk at rod C to rod A.
   Move disk at rod C to rod B.
   Move disk at rod A to rod B.
   Move disk at rod A to rod C.
   Move disk at rod B to rod C.
   Move disk at rod B to rod A.
   Move disk at rod C to rod A.
   Move disk at rod B to rod C.
   Move disk at rod A to rod B.
   Move disk at rod A to rod C.
   Move disk at rod B to rod C.
   #+end_example

   Note, of course, that this procedure too, is an exponential time
   procedure. However, any procedure for Hanoi will be exponential
   time, since for $n$ disks, Hanoi requires $2^{n-1}$ moves. Even if
   you compute every move in $O(1)$ (which we do, since it's just a
   print), the complexity will be $O(2^n)$.

** Iterative Fibonacci

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (iter-fib n a b)
       (if (= n 1)
           b
           (iter-fib (dec n) b (+ a b))))

     (define (fib n)
       (iter-fib n 0 1))

     (fib 10)
   #+END_SRC

   #+RESULTS:
   : 55

* Lecture 2A: Higher-Order Procedures

