video_notes/video_notes.org
** Abstracting Procedural Ideas

   Consider the functions and their respective (recursive) procedures:

   $$\sum_{i=a}^{b} i$$

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (sum-int a b)
       (if (> a b)
           0
           (+ a
              (sum-int (inc a) b))))

     (sum-int 0 10)
   #+END_SRC

   #+RESULTS:
   : 55

   $$\sum_{i=a}^{b} i^{2}$$

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
     <<square>>
     (define (sum-sq a b)
       (if (> a b)
           0
           (+ (square a)
              (sum-sq (inc a) b))))

     (sum-sq 0 4)
   #+END_SRC

   #+RESULTS:
   : 30

   $$\sum_{i=a_{\mathrm{~by~}4}}^{b} \frac{1}{i(i+2)}$$

   Note that this series estimates $\pi /8$.

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (sum-pi a b)
       (if (> a b)
           0
           (+ (/ 1
                 (* a (+ a 2)))
              (sum-pi (+ a 4) b))))

     (* 8 (sum-pi #i1 #i1000000))
   #+END_SRC

   #+RESULTS:
   : 3.141590653589793


   See that the commonality between these procedures comes from the
   fact that the notion of "summation" from =a= to =b= is the same,
   but the /function/ being summed is different in each case. Or, in
   general form:

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (<name> a b)
       (if (> a b)
           0
           (+ (<term> a)
              (<name> (<next> a) b))))
   #+END_SRC

   The way to solve this is by writing a procedure =sum=, which has
   available to it two procedures =term= and =next=. We supply these
   are arguments. Consider:

   #+NAME: sum
   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (sum term a next b)
       (if (> a b)
           0
           (+ (term a)
              (sum term (next a) next b))))
   #+END_SRC

   When we call =sum= recursively, see that we pass to it the /same
   procedures/ =term= and =next=, along with =b= and the next value of
   =a=. Now, it is easy to define =sum-int=, =sum-sq=, and =sum-pi=
   using =sum=, thus:

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
     <<sum>>
     (define (sum-int a b)
       (define (identity x) x)
       (sum identity
            a
            inc
            b))

     (sum-int 0 10)
   #+END_SRC

   #+RESULTS:
   : 55

   =identity= is the function $p(x) = x$.

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
     <<sum>>
     <<square>>
     (define (sum-sq a b)
       (sum square
            a
            inc
            b))

     (sum-sq 0 4)
   #+END_SRC

   #+RESULTS:
   : 30

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
     <<sum>>
     (define (sum-pi a b)
       (sum (lambda (x)
              (/ 1
                 (* x (+ x 2))))
            a
            (lambda (x) (+ x 4))
            b))

     (* 8 (sum-pi #i1 #i1000000))
   #+END_SRC

   #+RESULTS:
   : 3.141590653589793

   Recall that =lambda= means "make a procedure" that is nameless. In
   =sum-pi=, we choose to give it anonymous functions as arguments
   instead of defining our own, because there's no reason to name a
   procedure we won't later use.

   The big advantage of abstracting away =sum= this way is that in
   case we want to implement it in a different way, we merely have to
   change the implementation of one function (=sum=) and not that of
   the three functions that use it. In fact, those functions can
   remain exactly the same.

   Here's another implementation of =sum=. See that =sum-pi= still
   works without changes, because it doesn't care about how =sum= is
   implemented as long as the argument number and order remains
   constant.

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (sum term a next b)
       (define (iter j ans)
         (if (> j b)
             ans
             (iter (next j)
                   (+ (term j)
                      ans))))
       (iter a 0))

     (define (sum-pi a b)
       (sum (lambda (x)
              (/ 1
                 (* x (+ x 2))))
            a
            (lambda (x) (+ x 4))
            b))

     (* 8 (sum-pi #i1 #i1000000))
   #+END_SRC

   #+RESULTS:
   : 3.1415906535898936

** More on Square Roots

   Recall our square root procedure. When seen in Lisp code, it's not
   very clear what it's doing, or how it's working.

   #+NAME: no-dep-sqrt
   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (sqrt x)
       (define (good-enough-p g)
         (define (square g)
           (* g g))
         (define (abs y)
           (if (< y 0)
               (- y)
               y))
         (< (abs (- (square g) x))
            0.0001))
       (define (improve g)
         (define (average y z)
           (/ (+ y z) 2))
         (average g (/ x g)))
       (define (try g)
         (if (good-enough-p g)
             g
             (try (improve g))))
       (try 1))
   #+END_SRC

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
     <<no-dep-sqrt>>
     (sqrt #i2)
   #+END_SRC

   #+RESULTS:
   : 1.4142156862745097

   Let's use higher-order procedure abstraction to make it clearer.

*** Fixed Points

    Recall that the algorithm itself relies on writing a function

    $$f\colon y\mapsto \frac{y+\frac{x}{y}}{2}$$

    Note that this works because $f(\sqrt{x}) = \sqrt{x}$:

    $$f(\sqrt{x})=\frac{\sqrt{x}+\frac{x}{\sqrt{x}}}{2} = \frac{2\sqrt{x}}{2} = \sqrt{x}$$

    See that this is /actually/ an algorithm for finding a fixed point
    of a function $f$, which is defined as finding the point where
    $f(z)=z$. This algorithm is merely an instance of a function $f$
    whose fixed point happens to be the square root.

    #+begin_quote
    For some functions, the fixed point can be found by iterating it.
    #+end_quote

    This is the top-level abstraction we'll write a function for.
    First, let's see how we'd write a square-root function by wishful
    thinking:

    #+NAME: fp-sqrt
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<average>>
      (define (sqrt x)
        (fixed-point
         (lambda (y) (average (/ x y)
                              y))
         1))
    #+END_SRC

    Now writing =fixed-point=:

    #+NAME: fixed-point
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<abs>>
      (define (fixed-point f start)
        (define (close-enough-p x y)
          (< (abs (- x y))
             0.00001))
        (define (iter old new)
          (if (close-enough-p old new)
              new
              (iter new (f new))))
        (iter start (f start)))
    #+END_SRC

    Let's try it out!

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<fixed-point>>
      <<fp-sqrt>>
      (sqrt #i2)
    #+END_SRC

    #+RESULTS:
    : 1.4142135623746899

