video_notes/video_notes.tex

\section{Abstracting Procedural Ideas}
\label{sec:org3910909}

Consider the functions and their respective (recursive) procedures:

$$\sum_{i=a}^{b} i$$

\begin{minted}[]{racket}
(define (sum-int a b)
  (if (> a b)
      0
      (+ a
         (sum-int (inc a) b))))

(sum-int 0 10)
\end{minted}

\begin{verbatim}
55
\end{verbatim}


$$\sum_{i=a}^{b} i^{2}$$

\begin{minted}[]{racket}

(define (sum-sq a b)
  (if (> a b)
      0
      (+ (square a)
         (sum-sq (inc a) b))))

(sum-sq 0 4)
\end{minted}

\begin{verbatim}
30
\end{verbatim}


$$\sum_{i=a_{\mathrm{~by~}4}}^{b} \frac{1}{i(i+2)}$$

Note that this series estimates \(\pi /8\).

\begin{minted}[]{racket}
(define (sum-pi a b)
  (if (> a b)
      0
      (+ (/ 1
            (* a (+ a 2)))
         (sum-pi (+ a 4) b))))

(* 8 (sum-pi #i1 #i1000000))
\end{minted}

\begin{verbatim}
3.141590653589793
\end{verbatim}



See that the commonality between these procedures comes from the
fact that the notion of ``summation'' from \texttt{a} to \texttt{b} is the same,
but the \emph{function} being summed is different in each case. Or, in
general form:

\begin{minted}[]{racket}
(define (<name> a b)
  (if (> a b)
      0
      (+ (<term> a)
         (<name> (<next> a) b))))
\end{minted}

The way to solve this is by writing a procedure \texttt{sum}, which has
available to it two procedures \texttt{term} and \texttt{next}. We supply these
are arguments. Consider:

\begin{minted}[]{racket}
(define (sum term a next b)
  (if (> a b)
      0
      (+ (term a)
         (sum term (next a) next b))))
\end{minted}

When we call \texttt{sum} recursively, see that we pass to it the \emph{same
procedures} \texttt{term} and \texttt{next}, along with \texttt{b} and the next value of
\texttt{a}. Now, it is easy to define \texttt{sum-int}, \texttt{sum-sq}, and \texttt{sum-pi}
using \texttt{sum}, thus:

\begin{minted}[]{racket}

(define (sum-int a b)
  (define (identity x) x)
  (sum identity
       a
       inc
       b))

(sum-int 0 10)
\end{minted}

\begin{verbatim}
55
\end{verbatim}


\texttt{identity} is the function \(p(x) = x\).

\begin{minted}[]{racket}


(define (sum-sq a b)
  (sum square
       a
       inc
       b))

(sum-sq 0 4)
\end{minted}

\begin{verbatim}
30
\end{verbatim}


\begin{minted}[]{racket}

(define (sum-pi a b)
  (sum (lambda (x)
         (/ 1
            (* x (+ x 2))))
       a
       (lambda (x) (+ x 4))
       b))

(* 8 (sum-pi #i1 #i1000000))
\end{minted}

\begin{verbatim}
3.141590653589793
\end{verbatim}


Recall that \texttt{lambda} means ``make a procedure'' that is nameless. In
\texttt{sum-pi}, we choose to give it anonymous functions as arguments
instead of defining our own, because there's no reason to name a
procedure we won't later use.

The big advantage of abstracting away \texttt{sum} this way is that in
case we want to implement it in a different way, we merely have to
change the implementation of one function (\texttt{sum}) and not that of
the three functions that use it. In fact, those functions can
remain exactly the same.

Here's another implementation of \texttt{sum}. See that \texttt{sum-pi} still
works without changes, because it doesn't care about how \texttt{sum} is
implemented as long as the argument number and order remains
constant.

\begin{minted}[]{racket}
(define (sum term a next b)
  (define (iter j ans)
    (if (> j b)
        ans
        (iter (next j)
              (+ (term j)
                 ans))))
  (iter a 0))

(define (sum-pi a b)
  (sum (lambda (x)
         (/ 1
            (* x (+ x 2))))
       a
       (lambda (x) (+ x 4))
       b))

(* 8 (sum-pi #i1 #i1000000))
\end{minted}

\begin{verbatim}
3.1415906535898936
\end{verbatim}

\section{More on Square Roots}
\label{sec:org2b61b97}

Recall our square root procedure. When seen in Lisp code, it's not
very clear what it's doing, or how it's working.

\begin{minted}[]{racket}
(define (sqrt x)
  (define (good-enough-p g)
    (define (square g)
      (* g g))
    (define (abs y)
      (if (< y 0)
          (- y)
          y))
    (< (abs (- (square g) x))
       0.0001))
  (define (improve g)
    (define (average y z)
      (/ (+ y z) 2))
    (average g (/ x g)))
  (define (try g)
    (if (good-enough-p g)
        g
        (try (improve g))))
  (try 1))
\end{minted}

\begin{minted}[]{racket}

(sqrt #i2)
\end{minted}

\begin{verbatim}
1.4142156862745097
\end{verbatim}


Let's use higher-order procedure abstraction to make it clearer.

\subsection{Fixed Points}
\label{sec:org5aebd7a}

Recall that the algorithm itself relies on writing a function

$$f\colon y\mapsto \frac{y+\frac{x}{y}}{2}$$

Note that this works because \(f(\sqrt{x}) = \sqrt{x}\):

$$f(\sqrt{x})=\frac{\sqrt{x}+\frac{x}{\sqrt{x}}}{2} = \frac{2\sqrt{x}}{2} = \sqrt{x}$$

See that this is \emph{actually} an algorithm for finding a fixed point
of a function \(f\), which is defined as finding the point where
\(f(z)=z\). This algorithm is merely an instance of a function \(f\)
whose fixed point happens to be the square root.

\begin{quote}
For some functions, the fixed point can be found by iterating it.
\end{quote}

This is the top-level abstraction we'll write a function for.
First, let's see how we'd write a square-root function by wishful
thinking:

\begin{minted}[]{racket}

(define (sqrt x)
  (fixed-point
   (lambda (y) (average (/ x y)
                        y))
   1))
\end{minted}

Now writing \texttt{fixed-point}:

\begin{minted}[]{racket}

(define (fixed-point f start)
  (define (close-enough-p x y)
    (< (abs (- x y))
       0.00001))
  (define (iter old new)
    (if (close-enough-p old new)
        new
        (iter new (f new))))
  (iter start (f start)))
\end{minted}

Let's try it out!

\begin{minted}[]{racket}


(sqrt #i2)
\end{minted}

\begin{verbatim}
1.4142135623746899
\end{verbatim}
