video_notes/video_notes.tex

\subsection{Damping Oscillations}
\label{sec:org3e4786b}

A fair question when seeing the function
$$f_1\colon y\mapsto \frac{y+\frac{x}{y}}{2}$$
is why another function
$$f\colon y\mapsto \frac{x}{y}$$
wouldn't work in its place. It's a fair question, and is best
answered by trying to find its fixed point by iteration. Let's try
to find it for \(x=2\), starting at \(y=1\). Then,

$$f(1) = \frac{2}{1} = 2$$
$$f(2) = \frac{2}{2} = 1$$
$$f(1) = \frac{2}{1} = 2$$
$$f(2) = \frac{2}{2} = 1$$
$$~\hdots$$

It seems that instead of converging, this function is
\emph{oscillating} between two values. We know that it's easy to fix
this: we have to damp these oscillations. The most natural way to
do this is to take the average of successive values \(y\) and
\(f(y)\). A \texttt{sqrt} function that uses average damping would be:

\begin{minted}[]{racket}

(define (sqrt x)
  (fixed-point
   (avg-damp (lambda (y) (/ x y)))
   1))
\end{minted}

The \texttt{avg-damp} function takes in a procedure, creates an average damping
procedure, and returns it. Or, in Lisp:

\begin{minted}[]{racket}

(define avg-damp
  (lambda (f)
    (lambda (x) (average (f x) x))))
\end{minted}

It is worth discussing how \texttt{avg-damp} works. It is defined as a
procedure which takes the argument of a function \texttt{f}. It then
returns an anonymous procedure which takes an argument \texttt{x}, and
computes the average of \(f(x)\) and \(x\). This is finally the
highest level of abstraction we can reach for the \texttt{sqrt}
algorithm --- finding the fixed point of a damped oscillating
function.

Using the \texttt{sqrt} function,

\begin{minted}[]{racket}


(sqrt #i2)
\end{minted}

\begin{verbatim}
1.4142135623746899
\end{verbatim}

\section{Newton's Method}
\label{sec:org8494139}

Newton's method is used to find the zeros of a function (\(y \ni
   f(y)=0\)). To use it, start with some guess \(y_0\). Then,

$$y_{n+1} = y_n - \frac{f(y_n)}{f'(y_n)}$$

where $$f'(y) = \frac{\mathrm{d}f(y)}{\mathrm{d}y}$$

We can, of course, find the zero of the square root finding function
\(f(y) =  x-y^2\) using Newton's method. Note that Newton's method
\emph{itself} is based on fixed points, since it aims to find a fixed
point where \(y_{n+1}\approx y_n\).

Defining \texttt{sqrt}:

\begin{minted}[]{racket}

(define (sqrt x)
  (newton (lambda (y) (- x (square y)))
          1))
\end{minted}

We pass to \texttt{newton} a function \(f(y)=x-y^2\), since its zero is \(x=y^2\).

\begin{minted}[]{racket}

(define (newton f guess)
  (define df (deriv f))
  (fixed-point
   (lambda (x) (- x
                  (/ (f x)
                     (df x))))
   guess))
\end{minted}


It is important to note that defining \texttt{df} to be \texttt{(deriv f)} once
prevents wasteful recomputation of \texttt{df} every time \texttt{fixed-point}
calls itself.

Of course, we now have to define a derivative function. We can
simply use the standard limit definition to find it numerically:

$$f'(x) = \lim_{\Delta x\to 0} \frac{f(x+\Delta x) - f(x)}{\Delta
   x}$$

Or, in Lisp,

\begin{minted}[]{racket}
(define dx 0.0000001)

(define deriv
  (lambda (f)
    (lambda (x)
      (/ (- (f (+ x dx))
            (f x))
         dx))))


\end{minted}

This function returns a function which is the derivative of \texttt{f},
and can be used as such. Consider:

\begin{minted}[]{racket}

((deriv (lambda (x) (* x x x))) 2)
\end{minted}

\begin{verbatim}
12.000000584322379
\end{verbatim}


Which is the expected value of differentiating \(x^{3}\) w.r.t \(x\)
(\(3x^2\)) and evaluating at 2.

Testing out our \texttt{sqrt} function:

\begin{minted}[]{racket}



(sqrt #i2)
\end{minted}

\begin{verbatim}
1.4142135623747674
\end{verbatim}

\section{Procedures are First-Class Citizens}
\label{sec:orgd90e7da}

This means that procedures can be:
\begin{itemize}
\item Named using variables.
\item Passed as arguments to procedures.
\item Returned as values from procedures.
\item Included in data structures.
\end{itemize}

\chapter{Lecture 2B: Compound Data}
\label{sec:org8c6e60e}

Consider our \texttt{sqrt} function that uses \texttt{good-enough-p}. What we did
while writing \texttt{sqrt} is assume the existence of \texttt{good-enough-p}.
That is, we divorced the task of building \texttt{sqrt} from the task of
implementing its parts.

Let's do this for data.

\section{Rational Number Arithmetic}
\label{sec:org1fec059}

Let's design a system which can add fractions:
$$\frac{1}{2}+\frac{1}{4}=\frac{3}{4}$$
and multiply them:
$$\frac{3}{4}\times \frac{2}{3} = \frac{1}{2}$$

The \emph{procedures} for these two tasks are well known to most people:

$$\frac{n_1}{d_1} + \frac{n_2}{d_2} = \frac{n_1d_2+n_2d_2}{d_1d_2}$$
and
$$\frac{n_1}{d_1} \times \frac{n_2}{d_2} = \frac{n_1n_2}{d_1d_2}$$

\subsection{Abstraction}
\label{sec:org7b11891}
We don't know, however, how to represent this data in a Lisp
procedure. Let's use our powerful ``wishful thinking'' strategy.
Assume that we have the following procedures available to us:

\begin{itemize}
\item A constructor \texttt{(make-rat n d)} which makes a fraction with
numerator \texttt{n} and denominator \texttt{d}.
\item Two selectors:
\begin{itemize}
\item \texttt{(numer x)} which takes in a fraction \texttt{x} and returns its
numerator.
\item \texttt{(denom x)} which takes in a fraction \texttt{x} and returns its
denominator.
\end{itemize}
\end{itemize}

Then, our procedures are easy to write:

\begin{minted}[]{racket}
(define (+rat x y)
  (make-rat
   (+ (* (numer x) (denom y))
      (* (numer y) (denom x)))
   (* (denom x) (denom y))))

(define (*rat x y)
  (make-rat
   (* (numer x) (numer y))
   (* (denom x) (denom y))))
\end{minted}

Why do we need this data object abstraction anyway? We could very
well define \texttt{+rat} to take in four numbers, two numerators and two
denominators. But to return, we can't return \emph{both} numerator and
denominator. We now have to define two summation functions, one for
the numerator and one for the denominator, and somehow keep track
of the fact that one of these number is the numerator and the other
the denominator. Furthermore, when applying more complex operations
like:

\begin{minted}[]{racket}
(*rat (+rat x y)
      (+rat s t))
\end{minted}

The data abstraction helps. If it weren't there, we'd have to
maintain some temporary registers to store the numerator and
denominator values of the \texttt{+rat} operations into, then pass them to
\texttt{*rat}.

Worse than confusing the program, such a design philosophy would
confuse us, the programmers.
