video_notes/video_notes.org
*** Data Object Creation

    The glue we use to stick two numbers together is provided by three
    Lisp primitives:
    - A constructor =cons=, which generates an ordered pair.
    - Two selectors:
      - =car=, which selects the first element of the pair, and
      - =cdr=, which selects the second element of the pair.

    In use,
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define x (cons 1 2))
      (car x)
      (cdr x)
    #+END_SRC

    #+RESULTS:
    : 1
    : 2

    We can now write the procedures that we'd deferred writing
    earlier:

    #+NAME: make-rat
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (make-rat x y)
        (cons x y))

      (define (numer x)
        (car x))

      (define (denom x)
        (cdr x))
    #+END_SRC

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<frac-proc>>
      <<make-rat>>

      (define x (make-rat 1 2))
      (define y (make-rat 1 4))
      (define z (+rat x y))
      (numer z)
      (denom z)
    #+END_SRC

    #+RESULTS:
    : 6
    : 8

    Agh. We forgot to reduce results to the simplest form. We can
    easily include this in the =make-rat= procedure:[fn:1]

    #+NAME: make-rat-gcd
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (make-rat x y)
        (let ((g (gcd x y)))
          (cons (/ x g)
                (/ y g))))

      (define (numer x)
        (car x))

      (define (denom x)
        (cdr x))
    #+END_SRC

    Note that we could shift the =gcd= bit to functions =numer= and
    =denom=, which would display the simplest form at access time
    rather than creation time. Deciding between the two is a matter of
    system efficiency: a system which displays often should use
    creation time simplification, while a system which creates many
    fractions should use access time simplification.
    We now need a GCD function:

    #+NAME: gcd
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (gcd a b)
        (if (= b 0)
            a
            (gcd b (remainder a b))))
    #+END_SRC

    We can now use =+rat= in /exactly/ the same way, since the
    interface is the same. This is the advantage of abstraction.

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<make-rat-gcd>>
      <<frac-proc>>

      (define x (make-rat 1 2))
      (define y (make-rat 1 4))
      (define z (+rat x y))
      (numer z)
      (denom z)
    #+END_SRC

    #+RESULTS:
    : 3
    : 4

    Excellent: we now have a working system. The data abstraction
    model can be visualised as follows:

    #+begin_center
    \rule{6cm}{2pt}\\
    =+rat=, =*rat= ...\\
    \rule{6cm}{2pt}\\
    =make-rat=, =numer=, =denom=\\
    \rule{6cm}{2pt}\\
    =gcd=\\
    \rule{6cm}{2pt}\\
    Pairs\\
    \rule{6cm}{2pt}
    #+end_center

    At each layer of abstraction, we merely care about the usage of
    the lower layers and not their implementation or underlying
    representation.

** Representing Points on a Plane

   This is now an easy problem --- the code should be
   self-explanatory.

   #+NAME: make-vec
   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (make-vec x y)
       (cons x y))

     (define (xcor v)
       (car v))

     (define (ycor v)
       (cdr v))
   #+END_SRC

   We could now define a segment as a pair of vectors:

   #+NAME: make-seg
   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define (make-seg v w)
       (cons v w))

     (define (seg-start s)
       (car s))

     (define (seg-end s)
       (cdr s))
   #+END_SRC

   Some sample operations:

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
     <<average>>
     <<square>>
     <<no-dep-sqrt>>
     <<make-vec>>
     <<make-seg>>

     (define (midpoint s)
       (let ((a (seg-start s))
             (b (seg-end s)))
         (make-vec
          (average (xcor a) (xcor b))
          (average (ycor a) (ycor b)))))

     (define (length s)
       (let ((dx (- (xcor (seg-end s))
                    (xcor (seg-start s))))
             (dy (- (ycor (seg-end s))
                    (ycor (seg-start s)))))
         (sqrt (+ (square dx)
                  (square dy)))))

     (define side-a (make-vec #i3 #i0))
     (define side-b (make-vec #i0 #i4))
     (define segment (make-seg side-a side-b))

     (length segment)

     (define mp (midpoint segment))

     (xcor mp)
     (ycor mp)
   #+END_SRC

   #+RESULTS:
   : 5.000000000053722
   : 1.5
   : 2.0

   The abstraction layer diagram of this code is:
   #+begin_center
   \rule{6cm}{2pt}\\
   Segments\\
   \rule{6cm}{2pt}\\
   Vectors\\
   \rule{6cm}{2pt}\\
   Pairs\\
   \rule{6cm}{2pt}
   #+end_center

   It is interesting to note that segments are pairs of vectors,
   which are pairs of numbers, so segments are actually pairs of
   pairs. Represented as a tree:

   #+LATEX: \begin{center}
   #+LATEX: \begin{forest}
   #+LATEX: [$s$ [$\vec{v_{1}}$ [$x_{1}$] [$y_{1}$]] [$\vec{v_{2}}$ [$x_2$] [$y_2$]]]
   #+LATEX: \end{forest}
   #+LATEX: \end{center}

   This property is called /closure/ (from abstract algebra[fn:2]): that means
   of combination can be nested recursively. It's an important and
   powerful technique.

   For instance, a three-dimensional vector can be represented by a
   pair whose one element is a number and whose other element is a
   pair of numbers. Or, in Lisp:

   #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
     (define three-d-vec (cons 3 (cons 4 5)))
     (car three-d-vec)
     (car (cdr three-d-vec))
     (cdr (cdr three-d-vec))
   #+END_SRC

   #+RESULTS:
   : 3
   : 4
   : 5

