video_notes/video_notes.tex

\section{Pairs}
\label{sec:orgb70932f}

Let's go back to when we assumed that \texttt{make-rat}, \texttt{numer}, and
\texttt{denom}, were already implemented. The procedures we then wrote
were written using \emph{abstract data}, with the only ``assured''
property being that:

\begin{verse}
\texttt{if x = (make-rat n d):}\\
\vspace*{1em}
\hspace*{2em}\(\displaystyle \frac{\mathtt{numer~x}}{\mathtt{denom~x}} = \frac{\mathtt{n}}{\mathtt{d}}\)\\
\end{verse}

Beyond this basic ``spec'', or the interface contract, we know
nothing about its implementation.

Now, it's easy not to appreciate how knowing \emph{merely} the
specification of the layer below is sufficient to use it, so let's
discuss how pairs work. When we wanted to implement \texttt{make-rat}, we
kind of ``cheated'' in that we said, ``Okay, Lisp has a primitive to
do this so we don't have to implement a pair.'' Let's now take a
look at a possible implementation of a pair that doesn't use data
objects at all, and instead mimics them from thin air. Consider:

\begin{minted}[]{racket}
(define (our-cons a b)
  (lambda (pick)
    (cond ((= pick 1) a)
          ((= pick 2) b))))

(define (our-car x) (x 1))
(define (our-cdr x) (x 2))
\end{minted}

\begin{minted}[]{racket}

(define pair (our-cons 3 4))
(our-car pair)
(our-cdr pair)
\end{minted}

\begin{verbatim}
3
4
\end{verbatim}


Before thinking about how it works: consider the fact that Lisp's
pairs could be implemented this way, and not only would we not know
about this while implementing \texttt{make-rat} --- we wouldn't care,
since it's below the level of abstraction we're working at. As long
as it behaves the way we expect it to --- that is, it follows the
``spec'', we don't know or care about its implementation\footnote{Note that Lisp actually implements pairs using ``real'' data
structures, since using procedures this way is less efficient.}. Such is the
power of abstraction.

Now, how is this implementation even working? Well:
\begin{itemize}
\item \texttt{cons} is a procedure that returns a lambda (anonymous procedure)
which, by the substitution model, looks like:
\begin{minted}[]{racket}
(lambda (pick)
  (cond ((= pick 1) 3)
        ((= pick 2) 4)))
\end{minted}
\item \texttt{car} expects this procedure as an input, and returns the result of
supplying this procedure with the value 1. This is naturally the
first of the two numbers given to \texttt{cons} (\texttt{a}).
\item \texttt{cdr} is identical to \texttt{car}, except that \emph{it} supplies the input
procedure with argument 2 to get \texttt{b}.
\end{itemize}

We can thus implement a pair ``data structure'' using only lambdas.
In fact, these pairs are closed:

\begin{minted}[]{racket}

(define three-d-vec (our-cons 3 (our-cons 4 5)))
(our-car three-d-vec)
(our-car (our-cdr three-d-vec))
(our-cdr (our-cdr three-d-vec))
(our-cdr three-d-vec)
\end{minted}

\begin{verbatim}
3
4
5
#<procedure:...6f_i/ob-2136OZJ.rkt:4:2>
\end{verbatim}


It is worth thinking about the structure of \texttt{three-d-vec}:
\begin{minted}[]{racket}
(lambda (pick)
  (cond ((= pick 1) 3)
        ((= pick 2) (lambda (pick)
                      (cond ((= pick 1) 4)
                            ((= pick 2) 5))))))
\end{minted}

Picking \texttt{2} in the top-level lambda gives us another lambda, in
which we can pick either the first number (4) or the second (5).
Note that this is precisely the nested pair structure we were going
for.

\begin{center}
\begin{forest}
[$\lambda$(p) [3] [$\lambda$(p) [4] [5]]]
\end{forest}
\end{center}

\chapter{Lecture 3A: Henderson Escher Example}
\label{sec:orga0c612c}

Recall our vector procedures:

\begin{minted}[]{racket}
(define (make-vec x y)
  (cons x y))

(define (xcor v)
  (car v))

(define (ycor v)
  (cdr v))
\end{minted}

We could define more procedures using these:

\begin{minted}[]{racket}
(define (+vect v1 v2)
  (make-vec
   (+ (xcor v1) (xcor v2))
   (+ (ycor v1) (ycor v2))))

(define (scale v s)
  (make-vec
   (* s (xcor v))
   (* s (ycor v))))
\end{minted}

Recall that our representation of a line segment was as a pair of
vectors, or pair of pairs. That is, we can use the property of
closure that pairs have to store any amount of data.

\section{Lists}
\label{sec:orge6a7f35}
Often, we want to store a sequence of data. Using pairs, there are
many ways to do this, for instance:

\begin{minted}[]{racket}
(cons (cons 1 2) (cons 3 4))
(cons (cons 1 (cons 2 3)) 4)
\end{minted}

\begin{verbatim}
((1 . 2) 3 . 4)
((1 2 . 3) . 4)
\end{verbatim}


However, we want to establish a conventional way of dealing with
sequences, to prevent having to make ad-hoc choices. Lisp uses a
representation called a list:

\begin{minted}[]{racket}
(cons 1 (cons 2 (cons 3 (cons 4 nil))))
\end{minted}

\begin{verbatim}
(1 2 3 4)
\end{verbatim}


Note that the \texttt{nil} represents the null or empty list. Since
writing so many \texttt{cons} is painful, Lisp provides the primitive
\texttt{list} which lets us build such a structure.

\begin{minted}[]{racket}
(list 1 2 3 4)
\end{minted}

\begin{verbatim}
(1 2 3 4)
\end{verbatim}


Note that \texttt{list} is merely syntactic sugar for building up using
pairs:

\begin{minted}[]{racket}
(define one-to-four (list 1 2 3 4))
\end{minted}

\begin{minted}[]{racket}

(car one-to-four)
(cdr one-to-four)
(car (cdr one-to-four))
(cdr (cdr one-to-four))
(car (cdr (cdr (cdr one-to-four))))
(cdr (cdr (cdr (cdr one-to-four))))
\end{minted}

\begin{verbatim}
1
(2 3 4)
2
(3 4)
4
()
\end{verbatim}


Note that the empty list, \texttt{nil}, is also represented by \texttt{()}. This
way of walking down the list for elements is called \texttt{cdr}-ing down
a list, but it's a bit painful. Thus, when we want to process
lists, we write procedures.
