video_notes/video_notes.tex

\subsection{Procedures on Lists}
\label{sec:org58a0bcc}

Say we wanted to write a procedure \texttt{scale-list} which multiplies
every element in the list by a certain value. That is, when scale
list is called on \texttt{one-to-four} with value 10, it returns \texttt{(10 20
    30 40)}. Here's one possible (recursive) implementation:

\begin{minted}[]{racket}

(define (scale-list l scale)
  (if (null? l)
      nil
      (cons (* scale (car l))
            (scale-list (cdr l) scale))))

(scale-list one-to-four 10)
\end{minted}

\begin{verbatim}
(10 20 30 40)
\end{verbatim}


\texttt{null?} is a predicate which tells us whether the given input is
the empty list. This will be the case at the end of the list.
Of course, this is \emph{actually} a general method for processing all
values of a list and returning another list, so we write a
higher-order procedure which applies a procedure to all elements
of a list and returns the result as a list, called \texttt{map}.

\begin{minted}[]{racket}
(define (map p l)
  (if (null? l)
      nil
      (cons (p (car l))
            (map p (cdr l)))))
\end{minted}

Now defining \texttt{scale-list} in terms of \texttt{map}:

\begin{minted}[]{racket}


(define (scale-list l s)
  (map (lambda (x) (* x s))
       l))

(scale-list one-to-four 20)
\end{minted}

\begin{verbatim}
(20 40 60 80)
\end{verbatim}


We can now square lists:
\begin{minted}[]{racket}



(map square one-to-four)
\end{minted}

\begin{verbatim}
(1 4 9 16)
\end{verbatim}


Similar to \texttt{map}, we define a higher-order procedure \texttt{for-each},
which, instead of \texttt{cons}-ing a list and returning it, simply
applies to procedure to each element of the list.

\begin{minted}[]{racket}
(define (for-each proc l)
  (cond ((null? l) done)
        (else
         (proc (car l))
         (for-each proc (cdr l)))))
\end{minted}

\section{Henderson's Picture Language}
\label{sec:orgcea14a0}

Let's define a language. As usual, we'll concern ourselves with its
primitives, means of combination, and means of abstraction,
implementing some of this language in Lisp along the way.


\subsection{Primitives}
\label{sec:org6811f31}
This language has only one primitive: ``picture'', which is a figure
scaled to fit a rectangle.


\subsection{Means of Combination and Operations}
\label{sec:org573b49b}

\begin{itemize}
\item Rotate, which rotates a picture and returns it.
\item Flip, which flips the picture across an axis and returns it.
\item Beside, which takes two pictures and a scale, then puts the two
next to each other, returning a picture.
\item Above, like beside, but above.
\end{itemize}

See that the closure property (that an operation on pictures
returns a picture)\footnote{\(p \otimes p = p\)} allows us to combine these operations/means of
combination to build complex pictures with ease.

Let's now implement this part of the language.

\subsection{An Implementation}
\label{sec:org01e0630}

\begin{enumerate}
\item Rectangles
\label{sec:org6ab7f7f}

Three vectors are needed to uniquely identify a rectangle on the
plane. By convention, we take these to be the bottom left corner
(``origin''), the bottom right corner (``horizontal'') and the top
left corner (``vertical''). Their positions can be described
relative to the \((0,0)\) of the display screen. Therefore,
rectangle is implemented by:
\begin{itemize}
\item Constructor \texttt{make-rect}.
\item Selectors \texttt{origin}, \texttt{horiz}, and \texttt{vert}, for the three vectors.
\end{itemize}

Note that technically, a rectangle describes a transformation of
the unit square, where each point in the unit square:
$$(x,y)\mapsto \mathtt{origin} + x\cdot \mathtt{horiz} + y\cdot
     \mathtt{vert}$$

We can define a procedure which returns a procedure which maps
a pair of points \((x,y)\) on the unit square to a given rectangle:

\begin{minted}[]{racket}
(define (coord-map rect)
  (lambda (point)
    (+vect
     (+vect (scale (xcor point)
                   (horiz rect))
            (scale (ycor point)
                   (vert rect)))
     (origin rect))))
\end{minted}

\texttt{coord-map} returns a procedure which given a point will map it
correctly to \texttt{rect}.

\item Pictures
\label{sec:org8f545c1}

We can now easily define a procedure which makes a picture:
\begin{minted}[]{racket}
(define (make-picture seglist)
  (lambda (rect)
    (for-each
     (lambda (s)
       (drawline
        ((coord-map rect) (seg-start s))
        ((coord-map rect) (seg-end s))))
     seglist)))
\end{minted}

Well, relatively easily. Let's explain what \texttt{make-picture}
actually does:

\begin{itemize}
\item Takes argument \texttt{seglist}, which is a list of line segments
(pairs of vectors) that the picture is.
\item Returns a procedure which:
\begin{itemize}
\item Takes the argument of a rectangle.
\item For every element in \texttt{seglist}:
\begin{itemize}
\item Draws the segment within rectangle, by scaling it correctly
using \texttt{coord-map}.
\item This is done by giving \texttt{coord-map} the rectangle to scale
to.
\item The procedure returned by \texttt{coord-map} then scales the
vectors \texttt{(seg-start s)} and \texttt{(seg-end s)} to the rectangle.
\item This can now be drawn by \texttt{drawline}, since it has as
arguments two points.
\end{itemize}
\end{itemize}
\end{itemize}

Note that a picture is \emph{actually} a procedure which draws itself
inside a given rectangle, and \texttt{make-picture} generates this
procedure from a \texttt{seglist}. Or, in use:

\begin{minted}[]{racket}
(define R (make-rect ;some vectors
           ))
(define draw-george-in-rectangle (make-picture ;some seglist
                ))
(draw-george-in-rectangle R)
\end{minted}

\item Beside
\label{sec:org064ece5}

\texttt{beside} needs to draw two pictures on the screen, after scaling
them correctly (by \texttt{a}) and placing them side by side. Thus,
\texttt{beside} returns a picture which takes in an argument \texttt{rect}.
\texttt{beside} starts drawing the left picture at \texttt{(origin rect),
     (scale a (horiz rect)) (vert rect)} and the right picture at
\texttt{(+vect (origin rect) (scale a (horiz rect))), (scale (- 1 a)
     (horiz rect)), (vert rect)}. This places the two pictures side by
side and scales them correctly within \texttt{rect}. Or, in Lisp,

\begin{minted}[]{racket}
(define (beside p1 p2 a)
  (lambda (rect)
    (p1 (make-rect
         (origin rect)
         (scale a (horiz rect))
         (vert rect)))
    (p2 (make-rect
         (+vect (origin rect)
                (scale a (horiz rect)))
         (scale (-1 a) (horiz rect))
         (vert rect)))))
\end{minted}

\item Rotate-90
\label{sec:orgc61bb21}

To rotate a picture by 90 degrees counter-clockwise, all we have
to do is make the \texttt{origin} shift to where \texttt{horiz} is, then draw
the new \texttt{horiz} and \texttt{vert} correctly. With some vector algebra,
the procedure in Lisp is:

\begin{minted}[]{racket}
(define (rot90 pict)
  (lambda (rect)
    (pict (make-rect
           (+vect (origin rect)
                  (horiz rect))
           (vert rect)
           (scale -1 (horiz rect))))))
\end{minted}
\end{enumerate}
