video_notes/video_notes.org
*** Representation Implementation

    Let's start defining our procedures.

    #+NAME: atom?
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports none
      (define (atom? x)
        (and (not (null? x))
             (not (pair? x))))
    #+END_SRC


    #+NAME: deriv-preds
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (constant? expr var)
        (and (atom? expr)
             (not (eq? expr var))))

      (define (same-var? expr var)
        (and (atom? expr)
             (eq? expr var)))

      (define (sum? expr)
        (and (not (atom? expr))
             (eq? (car expr) '+)))

      (define (product? expr)
        (and (not (atom? expr))
             (eq? (car expr) '*)))
    #+END_SRC

    We see a new form here: ='+= and ='*=. This is called "quoting".
    Why do we need to do this? Consider:

    #+begin_verse
    "Say your name!"
    "Susanne."
    "Say 'your name'!"
    "Your name."
    #+end_verse

    To differentiate the cases where we mean /literally/ say "your
    name" and the case where we actually ask what "your name" /is/, we
    use quotation marks in English. Similarly, quoting a symbol in
    Lisp tells the interpreter to check /literally/ for =(car expr)=
    to be the symbol =+= and not the procedure =+=.

    Quotation is actually quite a complicated thing. Following the
    principle of substituting equals for equals, consider:

    #+begin_verse
    "Chicago" has seven letters.
    Chicago is the biggest city in Illinois.
    "The biggest city in Illinois" has seven letters.
    #+end_verse

    The first two statements are true, and quotation marks are used
    correctly in the first to show that we're talking about Chicago
    the word and not Chicago the city. However, the third statement is
    wrong entirely (although it is the result of changing equals for
    equals), because the phrase "The biggest city in Illinois" does
    not have seven letters.
    That is, we cannot substitute equals for equals in referentially
    opaque contexts.

    Note that the ='= symbol breaks the neat pattern of Lisp where all
    expressions are delimited by =()=. To resolve this, we introduce
    the special form =(quote +)=, which does the exactly same thing as
    ='+=.

    Now defining the constructors:

    #+NAME: deriv-makes
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (make-sum a1 a2)
        (list '+ a1 a2))

      (define (make-product m1 m2)
        (list '* m1 m2))
    #+END_SRC


    Finally, we must define the selectors:

    #+NAME: deriv-cadr
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define a1 cadr)
      (define a2 caddr)

      (define m1 cadr)
      (define m2 caddr)
    #+END_SRC


    =cadr= is the =car= of the =cdr= and =caddr= is the =car= of the
    =cdr= of the =cdr=. These are forms provided for convenience while
    programming, since list processing a big part of Lisp.[fn:5]

    Let's try it out:

    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<atom?>>
      <<deriv-preds>>
      <<deriv-makes>>
      <<deriv-cadr>>
      <<sym-deriv>>

      (deriv '(+ (* a (* x x)) (+ (* b x) c)) 'x)
      (deriv '(+ (* a (* x x)) (+ (* b x) c)) 'a)
      (deriv '(+ (* a (* x x)) (+ (* b x) c)) 'b)
      (deriv '(+ (* a (* x x)) (+ (* b x) c)) 'c)
    #+END_SRC

    #+RESULTS:
    : (+ (+ (* a (+ (* x 1) (* 1 x))) (* 0 (* x x))) (+ (+ (* b 1) (* 0 x)) 0))
    : (+ (+ (* a (+ (* x 0) (* 0 x))) (* 1 (* x x))) (+ (+ (* b 0) (* 0 x)) 0))
    : (+ (+ (* a (+ (* x 0) (* 0 x))) (* 0 (* x x))) (+ (+ (* b 0) (* 1 x)) 0))
    : (+ (+ (* a (+ (* x 0) (* 0 x))) (* 0 (* x x))) (+ (+ (* b 0) (* 0 x)) 1))

    Note the recursive nature of =deriv=: the process creates results
    with the same shape even when we differentiate with respect to
    some other variable. This is because the recursion only ends when
    an expression is decomposed to either =same-var?= or =constant?=.

*** Simplification

    However, these results are ugly, and we know why --- there's no
    simplification. Technically, it's correct:

    \begin{align*}
    &a(1x+1x) + 0x^{2} + b + 0x + 0\\
    =& 2ax + b
    \end{align*}

    Note that we've faced this same problem before with fractions, and
    recall that the solution was to change the constructors so that
    they'd simplify while creating the lists. Consider:

    #+NAME: deriv-makes-2
    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both
      (define (make-sum a1 a2)
        (cond ((and (number? a1)
                    (number? a2))
               (+ a1 a2))
              ((and (number? a1)
                    (= a1 0))
               a2)
               ((and (number? a2)
                    (= a2 0))
                a1)
               (else
                (list '+ a1 a2))))

      (define (make-product m1 m2)
        (cond ((and (number? m1)
                    (number? m2))
               (* m1 m2))
              ((and (number? m1)
                    (= m1 0))
               0)
               ((and (number? m2)
                    (= m2 0))
                0)
               ((and (number? m1)
                     (= m1 1))
                m2)
               ((and (number? m2)
                     (= m2 1))
                m1)
               (else
                (list '+ m1 m2))))
    #+END_SRC

    Now trying =deriv=:


    #+BEGIN_SRC racket :lang sicp :eval no-export :exports both :noweb strip-export
      <<atom?>>
      <<deriv-preds>>
      <<deriv-makes-2>>
      <<deriv-cadr>>
      <<sym-deriv>>

      (deriv '(+ (* a (* x x)) (+ (* b x) c)) 'x)
      (deriv '(+ (* a (* x x)) (+ (* b x) c)) 'a)
      (deriv '(+ (* a (* x x)) (+ (* b x) c)) 'b)
      (deriv '(+ (* a (* x x)) (+ (* b x) c)) 'c)
    #+END_SRC

    #+RESULTS:
    : (+ (+ a (+ x x)) b)
    : (* x x)
    : x
    : 1

    Excellent, these are much better. Note, of course, that we could
    simplify the first one further, but, in general, algebraic
    simplification is a painful problem, since the definition of
    simplest form varies with application. However, this is good
    enough.

** On Abstract Syntax

   Note that the syntax we used was abstract in the sense that it had
   its own rules and grammar. However, since it followed Lisp's syntax
   closely, we needed quotation to allow full expression.

   This is a powerful paradigm: not only can we use meta-linguistic
   abstraction to create languages embedded within Lisp, but we can
   also use Lisp to interpret any syntax. We'll see more of this in
   the future.

* Lecture 4A: Pattern Matching and Rule-Based Substitution

  It's a funny technique we used last time, converting the rules of
  differentiation to Lisp. In fact, if we wanted to explain (say) the
  rules of algebra to the computer, we'd have to again create a
  similar program which converts the rules of algebra to Lisp.

  See that there's a higher-order idea here, of explaining rules to
  Lisp and having the rules applied to an input expression to
  "simplify" it. Our style of writing a rule-based substitution
  program is:

  Rules \rightarrow conditional \rightarrow dispatch

  That is, we try the rules on the given expression. If there's a
  match, we "dispatch" the result to substitute. Now, in general, the
  application of a rule is:

  - Compare LHS of rule to input expression.
  - If match, RHS with substituted values is replacement.

  Or, diagrammatically:

  \[\begin{tikzcd} \mathrm{Pattern} \arrow{r}{\mathrm{Rule}}
  \arrow[swap]{d}{\mathrm{Matched}} & \mathrm{Skeleton}
  \arrow{d}{\mathrm{Instantiation}} \\ \mathrm{Expression_{Src}}
  \arrow[mapsto]{r} & \mathrm{Expression_{Target}} \end{tikzcd} \]

  Let us now build a simple language to express these rules, which can
  then be pattern matched, skeletons created, then instantiated.

