video_notes/video_notes.tex

\subsection{Representation Implementation}
\label{sec:orgb44b087}

Let's start defining our procedures.

\begin{minted}[]{racket}
(define (constant? expr var)
  (and (atom? expr)
       (not (eq? expr var))))

(define (same-var? expr var)
  (and (atom? expr)
       (eq? expr var)))

(define (sum? expr)
  (and (not (atom? expr))
       (eq? (car expr) '+)))

(define (product? expr)
  (and (not (atom? expr))
       (eq? (car expr) '*)))
\end{minted}

We see a new form here: \texttt{'+} and \texttt{'*}. This is called ``quoting''.
Why do we need to do this? Consider:

\begin{verse}
``Say your name!''\\
``Susanne.''\\
``Say `your name'!''\\
``Your name.''\\
\end{verse}

To differentiate the cases where we mean \emph{literally} say ``your
name'' and the case where we actually ask what ``your name'' \emph{is}, we
use quotation marks in English. Similarly, quoting a symbol in
Lisp tells the interpreter to check \emph{literally} for \texttt{(car expr)}
to be the symbol \texttt{+} and not the procedure \texttt{+}.

Quotation is actually quite a complicated thing. Following the
principle of substituting equals for equals, consider:

\begin{verse}
``Chicago'' has seven letters.\\
Chicago is the biggest city in Illinois.\\
``The biggest city in Illinois'' has seven letters.\\
\end{verse}

The first two statements are true, and quotation marks are used
correctly in the first to show that we're talking about Chicago
the word and not Chicago the city. However, the third statement is
wrong entirely (although it is the result of changing equals for
equals), because the phrase ``The biggest city in Illinois'' does
not have seven letters.
That is, we cannot substitute equals for equals in referentially
opaque contexts.

Note that the \texttt{'} symbol breaks the neat pattern of Lisp where all
expressions are delimited by \texttt{()}. To resolve this, we introduce
the special form \texttt{(quote +)}, which does the exactly same thing as
\texttt{'+}.

Now defining the constructors:

\begin{minted}[]{racket}
(define (make-sum a1 a2)
  (list '+ a1 a2))

(define (make-product m1 m2)
  (list '* m1 m2))
\end{minted}


Finally, we must define the selectors:

\begin{minted}[]{racket}
(define a1 cadr)
(define a2 caddr)

(define m1 cadr)
(define m2 caddr)
\end{minted}


\texttt{cadr} is the \texttt{car} of the \texttt{cdr} and \texttt{caddr} is the \texttt{car} of the
\texttt{cdr} of the \texttt{cdr}. These are forms provided for convenience while
programming, since list processing a big part of Lisp.\footnote{LISP actually stands for LISt Processing.}

Let's try it out:

\begin{minted}[]{racket}






(deriv '(+ (* a (* x x)) (+ (* b x) c)) 'x)
(deriv '(+ (* a (* x x)) (+ (* b x) c)) 'a)
(deriv '(+ (* a (* x x)) (+ (* b x) c)) 'b)
(deriv '(+ (* a (* x x)) (+ (* b x) c)) 'c)
\end{minted}

\begin{verbatim}
(+ (+ (* a (+ (* x 1) (* 1 x))) (* 0 (* x x))) (+ (+ (* b 1) (* 0 x)) 0))
(+ (+ (* a (+ (* x 0) (* 0 x))) (* 1 (* x x))) (+ (+ (* b 0) (* 0 x)) 0))
(+ (+ (* a (+ (* x 0) (* 0 x))) (* 0 (* x x))) (+ (+ (* b 0) (* 1 x)) 0))
(+ (+ (* a (+ (* x 0) (* 0 x))) (* 0 (* x x))) (+ (+ (* b 0) (* 0 x)) 1))
\end{verbatim}


Note the recursive nature of \texttt{deriv}: the process creates results
with the same shape even when we differentiate with respect to
some other variable. This is because the recursion only ends when
an expression is decomposed to either \texttt{same-var?} or \texttt{constant?}.

\subsection{Simplification}
\label{sec:orgafdbe75}

However, these results are ugly, and we know why --- there's no
simplification. Technically, it's correct:

\begin{align*}
&a(1x+1x) + 0x^{2} + b + 0x + 0\\
=& 2ax + b
\end{align*}

Note that we've faced this same problem before with fractions, and
recall that the solution was to change the constructors so that
they'd simplify while creating the lists. Consider:

\begin{minted}[]{racket}
(define (make-sum a1 a2)
  (cond ((and (number? a1)
              (number? a2))
         (+ a1 a2))
        ((and (number? a1)
              (= a1 0))
         a2)
         ((and (number? a2)
              (= a2 0))
          a1)
         (else
          (list '+ a1 a2))))

(define (make-product m1 m2)
  (cond ((and (number? m1)
              (number? m2))
         (* m1 m2))
        ((and (number? m1)
              (= m1 0))
         0)
         ((and (number? m2)
              (= m2 0))
          0)
         ((and (number? m1)
               (= m1 1))
          m2)
         ((and (number? m2)
               (= m2 1))
          m1)
         (else
          (list '+ m1 m2))))
\end{minted}

Now trying \texttt{deriv}:


\begin{minted}[]{racket}






(deriv '(+ (* a (* x x)) (+ (* b x) c)) 'x)
(deriv '(+ (* a (* x x)) (+ (* b x) c)) 'a)
(deriv '(+ (* a (* x x)) (+ (* b x) c)) 'b)
(deriv '(+ (* a (* x x)) (+ (* b x) c)) 'c)
\end{minted}

\begin{verbatim}
(+ (+ a (+ x x)) b)
(* x x)
x
1
\end{verbatim}


Excellent, these are much better. Note, of course, that we could
simplify the first one further, but, in general, algebraic
simplification is a painful problem, since the definition of
simplest form varies with application. However, this is good
enough.

\section{On Abstract Syntax}
\label{sec:orgec31c42}

Note that the syntax we used was abstract in the sense that it had
its own rules and grammar. However, since it followed Lisp's syntax
closely, we needed quotation to allow full expression.

This is a powerful paradigm: not only can we use meta-linguistic
abstraction to create languages embedded within Lisp, but we can
also use Lisp to interpret any syntax. We'll see more of this in
the future.

\chapter{Lecture 4A: Pattern Matching and Rule-Based Substitution}
\label{sec:org61b49df}

It's a funny technique we used last time, converting the rules of
differentiation to Lisp. In fact, if we wanted to explain (say) the
rules of algebra to the computer, we'd have to again create a
similar program which converts the rules of algebra to Lisp.

See that there's a higher-order idea here, of explaining rules to
Lisp and having the rules applied to an input expression to
``simplify'' it. Our style of writing a rule-based substitution
program is:

Rules \(\rightarrow\) conditional \(\rightarrow\) dispatch

That is, we try the rules on the given expression. If there's a
match, we ``dispatch'' the result to substitute. Now, in general, the
application of a rule is:

\begin{itemize}
\item Compare LHS of rule to input expression.
\item If match, RHS with substituted values is replacement.
\end{itemize}

Or, diagrammatically:

\[\begin{tikzcd} \mathrm{Pattern} \arrow{r}{\mathrm{Rule}}
  \arrow[swap]{d}{\mathrm{Matched}} & \mathrm{Skeleton}
  \arrow{d}{\mathrm{Instantiation}} \\ \mathrm{Expression_{Src}}
  \arrow[mapsto]{r} & \mathrm{Expression_{Target}} \end{tikzcd} \]

Let us now build a simple language to express these rules, which can
then be pattern matched, skeletons created, then instantiated.
