video_notes/video_notes.tex

\section{Rule Language}
\label{sec:org49f1236}

Here's a sample bit of what we want the rule language to look like:

\begin{minted}[]{racket}
(define deriv-rules
  '(
    ((dd (?c c) (? v)) 0)
    ((dd (?v v) (? v)) 1)
    ((dd (?v u) (? v)) 0)

    ((dd (+ (? x1) (? x2)) (? v))
     (+ (dd (: x1) (: v))
        (dd (: x2) (: v))))

    ((dd (* (? x1) (? x2)) (? v))
     (+ (* (: x1) (dd (: x2) (: v)))
        (* (: x2) (dd (: x1) (: v)))))
    ; ...
    ))
\end{minted}

It is worth explaining what this syntax means exactly, because
eventually, we want to parse it.

The rules are a list of pairs. The \texttt{car} of each pair is the
pattern to match (rule LHS), and the \texttt{cdr} is the skeleton
substitution expression (rule RHS).

\subsection{Pattern Matching}
\label{sec:orga9b6a64}

The idea of the LHS language is to provide a framework where
certain constructs can be matched and possibly named. These names
will then be passed to the skeleton instantiator.\footnote{We use ``initiate'' and ``substitute'' interchangeably to mean
swapping out expressions in the skeleton provided by the RHS of the
rules.}

\begin{center}
\begin{tabular}{ll}
\toprule
Syntax & Meaning\\
\midrule
\texttt{foo} & Matches itself literally.\\
\texttt{(f a b)} & Matches every 3-list whose \texttt{car} is \texttt{f}, \texttt{cadr} is \texttt{a}, and \texttt{caddr} is \texttt{b}.\\
\texttt{(? x)} & Matches any expression, and calls it \texttt{x}.\\
\texttt{(?c x)} & Matches an expression which is a constant, and calls it \texttt{x}.\\
\texttt{(?v x)} & Matches an expression which is a variable, and calls it \texttt{x}.\\
\bottomrule
\end{tabular}
\end{center}


\subsection{Skeleton and Instantiation}
\label{sec:orgad64d61}
The RHS language provides a skeleton wherein values provided by
the LHS language can be substituted.

\begin{center}
\begin{tabular}{ll}
\toprule
Syntax & Meaning\\
\midrule
\texttt{foo} & Instantiates \texttt{foo}.\\
\texttt{(f a b)} & Instantiates each element of the list and returns a list.\\
\texttt{(: x)} & Instantiate the value of \texttt{x} provided by the pattern matcher.\\
\bottomrule
\end{tabular}
\end{center}

\section{Sample Usage}
\label{sec:org339709d}

We expect to use this program by calling a procedure called
\texttt{simplifier}, to which we provide the list of rules. The procedure
should return another procedure, which is able to apply the rules
to a given input expression. Or, in Lisp:

\begin{minted}[]{racket}
(define dsimp
  (simplifier deriv-rules))

(dsimp '(dd (+ x y) x))
\end{minted}

\begin{verbatim}
(+ 1 0)
\end{verbatim}
\end{document}